Tekla Open API Reference for Tekla Structures 2025
View.ViewAttributes.LabelPositionHorizontal Property
 The horizontal position of the view label.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public View.HorizontalLabelPosition LabelPositionHorizontal { get; set; }
Public Property LabelPositionHorizontal As View.HorizontalLabelPosition
	Get
	Set
Property Value
Type: View.HorizontalLabelPosition
See Also
Reference
View.ViewAttributes Class
Tekla.Structures.Drawing Namespace